Revit 2024 API
ParameterTypeId.StairsWinderpatternNumberOfStraightStepsAtBegin Property
 "Parallel Treads at Start": Number of straight steps at the begin of winder
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsWinderpatternNumberOfStraightStepsAtBegin { get; }
Visual Basic
Public Shared ReadOnly Property StairsWinderpatternNumberOfStraightStepsAtBegin As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsWinderpatternNumberOfStraightStepsAtBegin {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace